<?php

$lang['required']			= "Поле '%s' должно быть заполнено.";
$lang['isset']				= "Поле '%s' должно иметь значение.";
$lang['valid_email']		= "Поле '%s' должно содержать правильный email-адрес.";
$lang['valid_emails']		= "Поле '%s' должно содержать правильные email-адреса.";
$lang['valid_url']			= "Поле '%s' должно содержать правильный URL.";
$lang['valid_ip']			= "Поле '%s' должно содержать правильный IP.";
$lang['min_length']			= "Поле '%s' должно длиной минимум '%s' символов.";
$lang['max_length']			= "Поле '%s' не может содержать больше '%s' символовой.";
$lang['exact_length']		= "Поле '%s' должно содержать точно '%s' символов.";
$lang['alpha']				= "Поле '%s' может содержать только символы буквы.";
$lang['alpha_numeric']		= "Поле '%s' может содержать буквы и цифры.";
$lang['alpha_dash']			= "Поле '%s' может содержать буквы, цифры, символы подчеркивания и пробелы.";
$lang['numeric']			= "Поле '%s' должно содержать только цифры.";
$lang['is_numeric']			= "Поле '%s' должно содержать только цифровые символы.";
$lang['integer']			= "Поле '%s' должно содержать только целые числа.";
$lang['regex_match']		= "Поле '%s' имеет неправильное значение.";
$lang['matches']			= "Поле '%s' не может содержать '%s' полей.";
$lang['is_unique'] 			= "Поле '%s' должно иметь уникальное значение.";
$lang['is_natural']			= "Поле '%s' должно иметь полько положительные значения.";
$lang['is_natural_no_zero']	= "Поле '%s' должно содержать значение больше нуля.";
$lang['decimal']			= "Поле '%s' должно содержать только десятичные числа.";
$lang['less_than']			= "Поле '%s' должно содержать число меньше '%s'.";
$lang['greater_than']		= "The '%s' должно содержать число больше '%s'.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */